app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      artist = Artist.find_by(id: params[:artist_id])

      if artist
        @songs = artist.songs
      else
        # artist#index if artist given but not found
        flash[:alert] = "Artist not found"
        redirect_to artists_path
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]

  def show
    @song = Song.find_by(id: params[:id])
    @artist = Artist.find_by(id: params[:artist_id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" IS NULL LIMIT ?  [["LIMIT", 1]]